In [4]:
import os

import pandas as pd
import numpy as np
import psycopg2

In [16]:
conn = psycopg2.connect(dbname="SB_Project", user= "postgres", password="postgres", host="localhost", port = "5432")
cursor = conn.cursor()
Indeed = "Indeed"
sql = f"select sum(Revenue), Sources from snider where Sources = '{Indeed}' group by Sources order by sum(Revenue) desc"

In [3]:
cursor.execute(sql)

my_data = []
for row in cursor.fetchall():
    print(row)
    my_data.append(row)

(326362.5144, 'Indeed')

In [4]:
df = pd.DataFrame(my_data)
df

             0       1
0  326362.5144  Indeed

In [5]:
table1 = df.rename(columns={0: "Revenue", 1: "Sources"})
table1

       Revenue Sources
0  326362.5144  Indeed

In [6]:
@app.route("/")
def index():
    """Return the homepage."""
    return render_template("index.html")

In [7]:
@app.route("/names")
def names():
    """Return a list of sample names."""

    # Use Pandas to perform the sql query
    stmt = db.session.query(Samples).statement
    df = pd.read_sql_query(stmt, db.session.bind)

    # Return a list of the column names (sample names)
    return jsonify(list(df.columns)[2:])

In [17]:

sql2 = f"select avg(Revenue), Sources from snider where Sources is not null group by Sources order by avg(Revenue) desc"
cursor.execute(sql2)
my_data2 = []
for row in cursor.fetchall():
        
    print(row)
    my_data2.append(row)

    df2 = pd.DataFrame(my_data2)
    table2 = df2.rename(columns={0: "AVG_Revenue", 1: "Sources"})
    table2
    
    data2 = {
        "Revenue2": table2["AVG_Revenue"].tolist(),
        "Sources2": table2["Sources"].tolist(),

    }

(933.138, 'Broadbean')
(534.287547619048, 'Advanced Careers')
(476.974441666667, 'Monster.com')
(442.076250735294, 'Zip Recruiter')
(415.608515482234, 'Friend/Relative Referral')
(411.076390322581, 'Other web site')
(381.57795915493, 'Newspaper Ad')
(370.445532803632, 'Indeed')
(335.524572082718, 'Craigslist')
(324.518977966102, 'Walk-In')
(297.940336842105, 'Flyer')

In [19]:
table2

    AVG_Revenue                   Sources
0    933.138000                 Broadbean
1    534.287548          Advanced Careers
2    476.974442               Monster.com
3    442.076251             Zip Recruiter
4    415.608515  Friend/Relative Referral
5    411.076390            Other web site
6    381.577959              Newspaper Ad
7    370.445533                    Indeed
8    335.524572                Craigslist
9    324.518978                   Walk-In
10   297.940337                     Flyer